# Задайте список из нескольких чисел. Напишите программу, которая найдёт сумму элементов списка, стоящих на нечётной позиции.
# Пример:
# - [2, 3, 5, 9, 3] -> на нечётных позициях элементы 3 и 9, ответ: 12
# a = [2, 3, 5, 9, 3]

from random import randint
a = [randint(0,9) for i in range(randint(5,30))]
sum_odd = 0
for i in range(1, len(a), 2):
    sum_odd += a[i]
print(f'Вариант 1: {a} -> {sum_odd}')
print(f'Вариант 2: {a} -> {sum(a[1::2])}')